# core/keyboard_layout.py

EN_TO_FA = {
    "q": "ض",
    "w": "ص",
    "e": "ث",
    "r": "ق",
    "t": "ف",
    "y": "غ",
    "u": "ع",
    "i": "ه",
    "o": "خ",
    "p": "ح",
    "[": "ج",
    "]": "چ",

    "a": "ش",
    "s": "س",
    "d": "ی",
    "f": "ب",
    "g": "ل",
    "h": "ا",
    "j": "ت",
    "k": "ن",
    "l": "م",
    ";": "ک",
    "'": "گ",

    "z": "ظ",
    "x": "ط",
    "c": "ز",
    "v": "ر",
    "b": "ذ",
    "n": "د",
    "m": "پ",

    ",": "و",
    "?": "؟",
}

FA_TO_EN = {v: k for k, v in EN_TO_FA.items()}